## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform
[command]/home/runner/work/_temp/4d8ae9b2-aa33-4f2e-a2af-4b3515402015/terraform-bin show -no-color main.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.sb.azurerm_servicebus_namespace.sb will be created
  + resource "azurerm_servicebus_namespace" "sb" {
      + capacity                            = 0
      + default_primary_connection_string   = (sensitive value)
      + default_primary_key                 = (sensitive value)
      + default_secondary_connection_string = (sensitive value)
      + default_secondary_key               = (sensitive value)
      + endpoint                            = (known after apply)
      + id                                  = (known after apply)
      + local_auth_enabled                  = true
      + location                            = "australiaeast"
      + minimum_tls_version                 = (known after apply)
      + name                                = "sb-biotrackr-prod-ae"
      + premium_messaging_partitions        = 0
      + public_network_access_enabled       = true
      + resource_group_name                 = "rg-biotrackr-prod-ae"
      + sku                                 = "Basic"
      + tags                                = {
          + "Application" = "biotrackr"
          + "Component"   = "Core-Infra"
          + "environment" = "Production"
          + "owner"       = "willvelida"
        }
      + zone_redundant                      = (known after apply)

      + identity {
          + identity_ids = [
              + "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.ManagedIdentity/userAssignedIdentities/uai-biotrackr-prod-ae",
            ]
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + network_rule_set (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # module.sb.azurerm_servicebus_namespace.sb will be created%0A  + resource "azurerm_servicebus_namespace" "sb" {%0A      + capacity                            = 0%0A      + default_primary_connection_string   = (sensitive value)%0A      + default_primary_key                 = (sensitive value)%0A      + default_secondary_connection_string = (sensitive value)%0A      + default_secondary_key               = (sensitive value)%0A      + endpoint                            = (known after apply)%0A      + id                                  = (known after apply)%0A      + local_auth_enabled                  = true%0A      + location                            = "australiaeast"%0A      + minimum_tls_version                 = (known after apply)%0A      + name                                = "sb-biotrackr-prod-ae"%0A      + premium_messaging_partitions        = 0%0A      + public_network_access_enabled       = true%0A      + resource_group_name                 = "rg-biotrackr-prod-ae"%0A      + sku                                 = "Basic"%0A      + tags                                = {%0A          + "Application" = "biotrackr"%0A          + "Component"   = "Core-Infra"%0A          + "environment" = "Production"%0A          + "owner"       = "willvelida"%0A        }%0A      + zone_redundant                      = (known after apply)%0A%0A      + identity {%0A          + identity_ids = [%0A              + "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.ManagedIdentity/userAssignedIdentities/uai-biotrackr-prod-ae",%0A            ]%0A          + principal_id = (known after apply)%0A          + tenant_id    = (known after apply)%0A          + type         = "UserAssigned"%0A        }%0A%0A      + network_rule_set (known after apply)%0A    }%0A%0APlan: 1 to add, 0 to change, 0 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>